---
kind: property
id: P:Autodesk.Revit.DB.Units.DecimalSymbol
source: html/30c371dc-2c58-5278-005c-5f690c02411c.htm
---
# Autodesk.Revit.DB.Units.DecimalSymbol Property

The symbol used to separate the integer and fractional parts of a number.

## Syntax (C#)
```csharp
public DecimalSymbol DecimalSymbol { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration